ClearDotX/TRK-KEA8_128/LINStack/Examples/S12ZVMC256_example/Carrasomne+_S12ZVMC256/S12ZVMC256_LIN_Slave/Lib/mc9s12zvmc256.c
/* Based on CPU DB MC9S12ZVMC256_80, version 3.00.000 (RegistersPrg V2.33) */
/* DataSheet : Rev. 2.0E 06 FEB 2015 */

#include <mc9s12zvmc256.h>

/*lint -save -esym(765, *) */


/* * * * *  8-BIT REGISTERS  * * * * * * * * * * * * * * * */
volatile INT_CFADDRSTR _INT_CFADDR;                        /* Interrupt Request Configuration Address Register; 0x00000017 */
volatile INT_CFDATA0STR _INT_CFDATA0;                      /* Interrupt Request Configuration Data Register 0; 0x00000018 */
volatile INT_CFDATA1STR _INT_CFDATA1;                      /* Interrupt Request Configuration Data Register 1; 0x00000019 */
volatile INT_CFDATA2STR _INT_CFDATA2;                      /* Interrupt Request Configuration Data Register 2; 0x0000001A */
volatile INT_CFDATA3STR _INT_CFDATA3;                      /* Interrupt Request Configuration Data Register 3; 0x0000001B */
volatile INT_CFDATA4STR _INT_CFDATA4;                      /* Interrupt Request Configuration Data Register 4; 0x0000001C */
volatile INT_CFDATA5STR _INT_CFDATA5;                      /* Interrupt Request Configuration Data Register 5; 0x0000001D */
volatile INT_CFDATA6STR _INT_CFDATA6;                      /* Interrupt Request Configuration Data Register 6; 0x0000001E */
volatile INT_CFDATA7STR _INT_CFDATA7;                      /* Interrupt Request Configuration Data Register 7; 0x0000001F */
volatile MODESTR _MODE;                                    /* Mode Register; 0x00000070 */
volatile MMCPCHSTR _MMCPCH;                                /* Captured S12ZCPU Program Counter High; 0x00000085 */
volatile MMCPCMSTR _MMCPCM;                                /* Captured S12ZCPU Program Counter Middle; 0x00000086 */
volatile MMCPCLSTR _MMCPCL;                                /* Captured S12ZCPU Program Counter Low; 0x00000087 */
volatile DBGC1STR _DBGC1;                                  /* Debug Control Register 1; 0x00000100 */
volatile DBGC2STR _DBGC2;                                  /* Debug Control Register 2; 0x00000101 */
volatile DBGTCRHSTR _DBGTCRH;                              /* Debug Trace Control Register High; 0x00000102 */
volatile DBGTCRLSTR _DBGTCRL;                              /* Debug Trace Control Register Low; 0x00000103 */
volatile DBGCNTSTR _DBGCNT;                                /* Debug Count Register; 0x00000106 */
volatile DBGSCR1STR _DBGSCR1;                              /* Debug State Control Register 1; 0x00000107 */
volatile DBGSCR2STR _DBGSCR2;                              /* Debug State Control Register 2; 0x00000108 */
volatile DBGSCR3STR _DBGSCR3;                              /* Debug State Control Register 3; 0x00000109 */
volatile DBGEFRSTR _DBGEFR;                                /* Debug Event Flag Register; 0x0000010A */
volatile DBGSRSTR _DBGSR;                                  /* Debug Status Register; 0x0000010B */
volatile DBGACTLSTR _DBGACTL;                              /* Debug Comparator A Control Register; 0x00000110 */
volatile DBGAAHSTR _DBGAAH;                                /* Debug Comparator A Address Register High; 0x00000115 */
volatile DBGAAMSTR _DBGAAM;                                /* Debug Comparator A Address Register Middle; 0x00000116 */
volatile DBGAALSTR _DBGAAL;                                /* Debug Comparator A Address Register Low; 0x00000117 */
volatile DBGAD0STR _DBGAD0;                                /* Debug Comparator A Data Register 0; 0x00000118 */
volatile DBGAD1STR _DBGAD1;                                /* Debug Comparator A Data Register 1; 0x00000119 */
volatile DBGAD2STR _DBGAD2;                                /* Debug Comparator A Data Register 2; 0x0000011A */
volatile DBGAD3STR _DBGAD3;                                /* Debug Comparator A Data Register 3; 0x0000011B */
volatile DBGADM0STR _DBGADM0;                              /* Debug Comparator A Data Mask Register 0; 0x0000011C */
volatile DBGADM1STR _DBGADM1;                              /* Debug Comparator A Data Mask Register 1; 0x0000011D */
volatile DBGADM2STR _DBGADM2;                              /* Debug Comparator A Data Mask Register 2; 0x0000011E */
volatile DBGADM3STR _DBGADM3;                              /* Debug Comparator A Data Mask Register 3; 0x0000011F */
volatile DBGBCTLSTR _DBGBCTL;                              /* Debug Comparator B Control Register; 0x00000120 */
volatile DBGBAHSTR _DBGBAH;                                /* Debug Comparator B Address Register High; 0x00000125 */
volatile DBGBAMSTR _DBGBAM;                                /* Debug Comparator B Address Register Middle; 0x00000126 */
volatile DBGBALSTR _DBGBAL;                                /* Debug Comparator B Address Register Low; 0x00000127 */
volatile DBGCCTLSTR _DBGCCTL;                              /* Debug Comparator C Control Register; 0x00000130 */
volatile DBGCAHSTR _DBGCAH;                                /* Debug Comparator C Address Register High; 0x00000135 */
volatile DBGCAMSTR _DBGCAM;                                /* Debug Comparator C Address Register Middle; 0x00000136 */
volatile DBGCALSTR _DBGCAL;                                /* Debug Comparator C Address Register Low; 0x00000137 */
volatile DBGCD0STR _DBGCD0;                                /* Debug Comparator C Data Register 0; 0x00000138 */
volatile DBGCD1STR _DBGCD1;                                /* Debug Comparator C Data Register 1; 0x00000139 */
volatile DBGCD2STR _DBGCD2;                                /* Debug Comparator C Data Register 2; 0x0000013A */
volatile DBGCD3STR _DBGCD3;                                /* Debug Comparator C Data Register 3; 0x0000013B */
volatile DBGCDM0STR _DBGCDM0;                              /* Debug Comparator C Data Mask Register 0; 0x0000013C */
volatile DBGCDM1STR _DBGCDM1;                              /* Debug Comparator C Data Mask Register 1; 0x0000013D */
volatile DBGCDM2STR _DBGCDM2;                              /* Debug Comparator C Data Mask Register 2; 0x0000013E */
volatile DBGCDM3STR _DBGCDM3;                              /* Debug Comparator C Data Mask Register 3; 0x0000013F */
volatile DBGDCTLSTR _DBGDCTL;                              /* Debug Comparator D Control Register; 0x00000140 */
volatile DBGDAHSTR _DBGDAH;                                /* Debug Comparator D Address Register High; 0x00000145 */
volatile DBGDAMSTR _DBGDAM;                                /* Debug Comparator D Address Register Middle; 0x00000146 */
volatile DBGDALSTR _DBGDAL;                                /* Debug Comparator D Address Register Low; 0x00000147 */
volatile MODRR0STR _MODRR0;                                /* Module Routing Register 0; 0x00000200 */
volatile MODRR1STR _MODRR1;                                /* Module Routing Register 1; 0x00000201 */
volatile MODRR2STR _MODRR2;                                /* Module Routing Register 2; 0x00000202 */
volatile ECLKCTLSTR _ECLKCTL;                              /* ECLK Control Register; 0x00000208 */
volatile IRQCRSTR _IRQCR;                                  /* Interrupt Control Register; 0x00000209 */
volatile PIMMISCSTR _PIMMISC;                              /* PIM Miscellaneous Register; 0x0000020A */
volatile PTESTR _PTE;                                      /* Port E Data Register; 0x00000260 */
volatile PTIESTR _PTIE;                                    /* Port E Input Register; 0x00000262 */
volatile DDRESTR _DDRE;                                    /* Port E Data Direction Register; 0x00000264 */
volatile PERESTR _PERE;                                    /* Port E Pull Device Enable Register; 0x00000266 */
volatile PPSESTR _PPSE;                                    /* Port E Polarity Select Register; 0x00000268 */
volatile PTTSTR _PTT;                                      /* Port T Data Register; 0x000002C0 */
volatile PTITSTR _PTIT;                                    /* Port T Input Register; 0x000002C1 */
volatile DDRTSTR _DDRT;                                    /* Port T Data Direction Register; 0x000002C2 */
volatile PERTSTR _PERT;                                    /* Port T Pull Device Enable Register; 0x000002C3 */
volatile PPSTSTR _PPST;                                    /* Port T Polarity Select Register; 0x000002C4 */
volatile PTSSTR _PTS;                                      /* Port S Data Register; 0x000002D0 */
volatile PTISSTR _PTIS;                                    /* Port S Input Register; 0x000002D1 */
volatile DDRSSTR _DDRS;                                    /* Port S Data Direction Register; 0x000002D2 */
volatile PERSSTR _PERS;                                    /* Port S Pull Device Enable Register; 0x000002D3 */
volatile PPSSSTR _PPSS;                                    /* Port S Polarity Select Register; 0x000002D4 */
volatile PIESSTR _PIES;                                    /* Port S Interrupt Enable Register; 0x000002D6 */
volatile PIFSSTR _PIFS;                                    /* Port S Interrupt Flag Register; 0x000002D7 */
volatile WOMSSTR _WOMS;                                    /* Port S Wired-Or Mode Register; 0x000002DF */
volatile PTPSTR _PTP;                                      /* Port P Data Register; 0x000002F0 */
volatile PTIPSTR _PTIP;                                    /* Port P Input Register; 0x000002F1 */
volatile DDRPSTR _DDRP;                                    /* Port P Data Direction Register; 0x000002F2 */
volatile PERPSTR _PERP;                                    /* Port P Pull Device Enable Register; 0x000002F3 */
volatile PPSPSTR _PPSP;                                    /* Port P Polarity Select Register; 0x000002F4 */
volatile PIEPSTR _PIEP;                                    /* Port P Interrupt Enable Register; 0x000002F6 */
volatile PIFPSTR _PIFP;                                    /* Port P Interrupt Flag Register; 0x000002F7 */
volatile RDRPSTR _RDRP;                                    /* Port P Reduced Drive Register; 0x000002FD */
volatile PTILSTR _PTIL;                                    /* Port L Input Register; 0x00000331 */
volatile PTPSLSTR _PTPSL;                                  /* Port L Pull Select Register; 0x00000333 */
volatile PPSLSTR _PPSL;                                    /* Port L Polarity Select Register; 0x00000334 */
volatile PIELSTR _PIEL;                                    /* Port L Interrupt Enable Register; 0x00000336 */
volatile PIFLSTR _PIFL;                                    /* Port L Interrupt Flag Register; 0x00000337 */
volatile PTABYPLSTR _PTABYPL;                              /* Port L ADC Bypass Register; 0x0000033A */
volatile PTADIRLSTR _PTADIRL;                              /* Port L ADC Direct Register; 0x0000033B */
volatile DIENLSTR _DIENL;                                  /* Port LDigital Input Enable Register; 0x0000033C */
volatile PTAENLSTR _PTAENL;                                /* Port L ADC Connection Enable Register; 0x0000033D */
volatile PIRLSTR _PIRL;                                    /* Port L Input Divider Ratio Selection Register; 0x0000033E */
volatile PTTELSTR _PTTEL;                                  /* Port L Test Enable Register; 0x0000033F */
volatile FCLKDIVSTR _FCLKDIV;                              /* Flash Clock Divider Register; 0x00000380 */
volatile FSECSTR _FSEC;                                    /* Flash Security Register; 0x00000381 */
volatile FCCOBIXSTR _FCCOBIX;                              /* Flash CCOB Index Register; 0x00000382 */
volatile FPSTATSTR _FPSTAT;                                /* Flash Protection Status Register; 0x00000383 */
volatile FCNFGSTR _FCNFG;                                  /* Flash Configuration Register; 0x00000384 */
volatile FERCNFGSTR _FERCNFG;                              /* Flash Error Configuration Register; 0x00000385 */
volatile FSTATSTR _FSTAT;                                  /* Flash Status Register; 0x00000386 */
volatile FERSTATSTR _FERSTAT;                              /* Flash Error Status Register; 0x00000387 */
volatile FPROTSTR _FPROT;                                  /* P-Flash Protection Register; 0x00000388 */
volatile DFPROTSTR _DFPROT;                                /* EEPROM Protection Register; 0x00000389 */
volatile FOPTSTR _FOPT;                                    /* Flash Option Register; 0x0000038A */
volatile ECCSTATSTR _ECCSTAT;                              /* ECC Status Register; 0x000003C0 */
volatile ECCIESTR _ECCIE;                                  /* ECC Interrupt Enable Register; 0x000003C1 */
volatile ECCIFSTR _ECCIF;                                  /* ECC Interrupt Flag Register; 0x000003C2 */
volatile ECCDPTRHSTR _ECCDPTRH;                            /* ECC Debug Pointer Register High; 0x000003C7 */
volatile ECCDPTRMSTR _ECCDPTRM;                            /* ECC Debug Pointer Register Middle; 0x000003C8 */
volatile ECCDPTRLSTR _ECCDPTRL;                            /* ECC Debug Pointer Register Low; 0x000003C9 */
volatile ECCDESTR _ECCDE;                                  /* ECC Debug ECC; 0x000003CE */
volatile ECCDCMDSTR _ECCDCMD;                              /* ECC Debug Comamnd; 0x000003CF */
volatile TIM1TIOSSTR _TIM1TIOS;                            /* Timer Input Capture/Output Compare Select; 0x00000400 */
volatile TIM1CFORCSTR _TIM1CFORC;                          /* Timer Compare Force Register; 0x00000401 */
volatile TIM1TSCR1STR _TIM1TSCR1;                          /* Timer System Control Register1; 0x00000406 */
volatile TIM1TTOVSTR _TIM1TTOV;                            /* Timer Toggle On Overflow Register; 0x00000407 */
volatile TIM1TCTL2STR _TIM1TCTL2;                          /* Timer Control Register 2; 0x00000409 */
volatile TIM1TCTL4STR _TIM1TCTL4;                          /* Timer Control Register 4; 0x0000040B */
volatile TIM1TIESTR _TIM1TIE;                              /* Timer Interrupt Enable Register; 0x0000040C */
volatile TIM1TSCR2STR _TIM1TSCR2;                          /* Timer System Control Register 2; 0x0000040D */
volatile TIM1TFLG1STR _TIM1TFLG1;                          /* Main Timer Interrupt Flag 1; 0x0000040E */
volatile TIM1TFLG2STR _TIM1TFLG2;                          /* Main Timer Interrupt Flag 2; 0x0000040F */
volatile TIM1OCPDSTR _TIM1OCPD;                            /* Output Compare Pin Disconnect Register; 0x0000042C */
volatile TIM1PTPSRSTR _TIM1PTPSR;                          /* Precision Timer Prescaler Select Register; 0x0000042E */
volatile PWMESTR _PWME;                                    /* PWM Enable Register; 0x00000480 */
volatile PWMPOLSTR _PWMPOL;                                /* PWM Polarity Register; 0x00000481 */
volatile PWMCLKSTR _PWMCLK;                                /* PWM Clock Select Register; 0x00000482 */
volatile PWMPRCLKSTR _PWMPRCLK;                            /* PWM Prescale Clock Select Register; 0x00000483 */
volatile PWMCAESTR _PWMCAE;                                /* PWM Center Align Enable Register; 0x00000484 */
volatile PWMCTLSTR _PWMCTL;                                /* PWM Control Register; 0x00000485 */
volatile PWMCLKABSTR _PWMCLKAB;                            /* PWM Clock A/B Select Register; 0x00000486 */
volatile PWMSCLASTR _PWMSCLA;                              /* PWM Scale A Register; 0x00000488 */
volatile PWMSCLBSTR _PWMSCLB;                              /* PWM Scale B Register; 0x00000489 */
volatile PWMCNT0STR _PWMCNT0;                              /* PWM Channel Counter 0 Register; 0x0000048C */
volatile PWMCNT1STR _PWMCNT1;                              /* PWM Channel Counter 1 Register; 0x0000048D */
volatile PWMCNT2STR _PWMCNT2;                              /* PWM Channel Counter 2 Register; 0x0000048E */
volatile PWMCNT3STR _PWMCNT3;                              /* PWM Channel Counter 3 Register; 0x0000048F */
volatile PWMCNT4STR _PWMCNT4;                              /* PWM Channel Counter 4 Register; 0x00000490 */
volatile PWMCNT5STR _PWMCNT5;                              /* PWM Channel Counter 5 Register; 0x00000491 */
volatile PWMCNT6STR _PWMCNT6;                              /* PWM Channel Counter 6 Register; 0x00000492 */
volatile PWMCNT7STR _PWMCNT7;                              /* PWM Channel Counter 7 Register; 0x00000493 */
volatile PWMPER0STR _PWMPER0;                              /* PWM Channel Period 0 Register; 0x00000494 */
volatile PWMPER1STR _PWMPER1;                              /* PWM Channel Period 1 Register; 0x00000495 */
volatile PWMPER2STR _PWMPER2;                              /* PWM Channel Period 2 Register; 0x00000496 */
volatile PWMPER3STR _PWMPER3;                              /* PWM Channel Period 3 Register; 0x00000497 */
volatile PWMPER4STR _PWMPER4;                              /* PWM Channel Period 4 Register; 0x00000498 */
volatile PWMPER5STR _PWMPER5;                              /* PWM Channel Period 5 Register; 0x00000499 */
volatile PWMPER6STR _PWMPER6;                              /* PWM Channel Period 6 Register; 0x0000049A */
volatile PWMPER7STR _PWMPER7;                              /* PWM Channel Period 7 Register; 0x0000049B */
volatile PWMDTY0STR _PWMDTY0;                              /* PWM Channel Duty 0 Register; 0x0000049C */
volatile PWMDTY1STR _PWMDTY1;                              /* PWM Channel Duty 1 Register; 0x0000049D */
volatile PWMDTY2STR _PWMDTY2;                              /* PWM Channel Duty 2 Register; 0x0000049E */
volatile PWMDTY3STR _PWMDTY3;                              /* PWM Channel Duty 3 Register; 0x0000049F */
volatile PWMDTY4STR _PWMDTY4;                              /* PWM Channel Duty 4 Register; 0x000004A0 */
volatile PWMDTY5STR _PWMDTY5;                              /* PWM Channel Duty 5 Register; 0x000004A1 */
volatile PWMDTY6STR _PWMDTY6;                              /* PWM Channel Duty 6 Register; 0x000004A2 */
volatile PWMDTY7STR _PWMDTY7;                              /* PWM Channel Duty 7 Register; 0x000004A3 */
volatile PMFCFG0STR _PMFCFG0;                              /* PMF Configure 0 Register; 0x00000500 */
volatile PMFCFG1STR _PMFCFG1;                              /* PMF Configure 1 Register; 0x00000501 */
volatile PMFCFG2STR _PMFCFG2;                              /* PMF Configure 2 Register; 0x00000502 */
volatile PMFCFG3STR _PMFCFG3;                              /* PMF Configure 3 Register; 0x00000503 */
volatile PMFFENSTR _PMFFEN;                                /* PMF Fault Enable Register; 0x00000504 */
volatile PMFFMODSTR _PMFFMOD;                              /* PMF Fault Mode Register; 0x00000505 */
volatile PMFFIESTR _PMFFIE;                                /* PMF Fault Interrupt Enable Register; 0x00000506 */
volatile PMFFIFSTR _PMFFIF;                                /* PMF Fault Interrupt Flag Register; 0x00000507 */
volatile PMFQSMP0STR _PMFQSMP0;                            /* PMF Fault Qualifying Samples Register 0; 0x00000508 */
volatile PMFQSMP1STR _PMFQSMP1;                            /* PMF Fault Qualifying Samples Register 1; 0x00000509 */
volatile PMFOUTCSTR _PMFOUTC;                              /* PMF Output Control Register; 0x0000050C */
volatile PMFOUTBSTR _PMFOUTB;                              /* PMF Output Control Bit Register; 0x0000050D */
volatile PMFDTMSSTR _PMFDTMS;                              /* PMF Deadtime Sample Register; 0x0000050E */
volatile PMFCCTLSTR _PMFCCTL;                              /* PMF Correction Control Register; 0x0000050F */
volatile PMFROIESTR _PMFROIE;                              /* PMF Reload Overrun Interrupt Enable Register; 0x0000051C */
volatile PMFROIFSTR _PMFROIF;                              /* PMF Interrupt Flag Register; 0x0000051D */
volatile PMFICCTLSTR _PMFICCTL;                            /* PMF Internal Correction Control Register; 0x0000051E */
volatile PMFCINVSTR _PMFCINV;                              /* PMF Compare Invert Register; 0x0000051F */
volatile PMFENCASTR _PMFENCA;                              /* PMF Enable Control A Register; 0x00000520 */
volatile PMFFQCASTR _PMFFQCA;                              /* PMF Frequency Control A Register; 0x00000521 */
volatile PMFENCBSTR _PMFENCB;                              /* PMF Enable Control B Register; 0x00000528 */
volatile PMFFQCBSTR _PMFFQCB;                              /* PMF Frequency Control B Register; 0x00000529 */
volatile PMFENCCSTR _PMFENCC;                              /* PMF Enable Control C Register; 0x00000530 */
volatile PMFFQCCSTR _PMFFQCC;                              /* PMF Frequency Control C Register; 0x00000531 */
volatile PMFDMP0STR _PMFDMP0;                              /* PMF Disable Mapping Register 0; 0x00000538 */
volatile PMFDMP1STR _PMFDMP1;                              /* PMF Disable Mapping Register 1; 0x00000539 */
volatile PMFDMP2STR _PMFDMP2;                              /* PMF Disable Mapping Register 2; 0x0000053A */
volatile PMFDMP3STR _PMFDMP3;                              /* PMF Disable Mapping Register 3; 0x0000053B */
volatile PMFDMP4STR _PMFDMP4;                              /* PMF Disable Mapping Register 4; 0x0000053C */
volatile PMFDMP5STR _PMFDMP5;                              /* PMF Disable Mapping Register 5; 0x0000053D */
volatile PMFOUTFSTR _PMFOUTF;                              /* PMF Output Control on Fault Register; 0x0000053E */
volatile PTUESTR _PTUE;                                    /* PTU Enable Register; 0x00000580 */
volatile PTUCSTR _PTUC;                                    /* PTU Module Control Register; 0x00000581 */
volatile PTUIEHSTR _PTUIEH;                                /* PTU Interrupt Enable Register High; 0x00000582 */
volatile PTUIELSTR _PTUIEL;                                /* PTU Interrupt Enable Register Low; 0x00000583 */
volatile PTUIFHSTR _PTUIFH;                                /* PTU Interrupt Flag Register High; 0x00000584 */
volatile PTUIFLSTR _PTUIFL;                                /* PTU Interrupt Flag Register Low; 0x00000585 */
volatile TG0LISTSTR _TG0LIST;                              /* Trigger Generator 0 List Register; 0x00000586 */
volatile TG0TNUMSTR _TG0TNUM;                              /* Trigger Generator 0 Trigger Number Register; 0x00000587 */
volatile TG0TVHSTR _TG0TVH;                                /* Trigger Generator 0 Trigger Value; 0x00000588 */
volatile TG0TVLSTR _TG0TVL;                                /* Trigger Generator 0 Trigger Value; 0x00000589 */
volatile TG1LISTSTR _TG1LIST;                              /* Trigger Generator 1 List Register; 0x0000058A */
volatile TG1TNUMSTR _TG1TNUM;                              /* Trigger Generator 1 Trigger Number Register; 0x0000058B */
volatile TG1TVHSTR _TG1TVH;                                /* Trigger Generator 1 Trigger Value; 0x0000058C */
volatile TG1TVLSTR _TG1TVL;                                /* Trigger Generator 1 Trigger Value; 0x0000058D */
volatile PTUCNTHSTR _PTUCNTH;                              /* PTU Counter Register; 0x0000058E */
volatile PTUCNTLSTR _PTUCNTL;                              /* PTU Counter Register; 0x0000058F */
volatile PTUPTRHSTR _PTUPTRH;                              /* PTU Pointer Register; 0x00000591 */
volatile PTUPTRMSTR _PTUPTRM;                              /* PTU Pointer Register; 0x00000592 */
volatile PTUPTRLSTR _PTUPTRL;                              /* PTU Pointer Register; 0x00000593 */
volatile TG0L0IDXSTR _TG0L0IDX;                            /* Trigger Generator 0 List 0 Index Register; 0x00000594 */
volatile TG0L1IDXSTR _TG0L1IDX;                            /* Trigger Generator 0 List 1 Index Register; 0x00000595 */
volatile TG1L0IDXSTR _TG1L0IDX;                            /* Trigger Generator 1 List 0 Index Register; 0x00000596 */
volatile TG1L1IDXSTR _TG1L1IDX;                            /* Trigger Generator 1 List 1 Index Register; 0x00000597 */
volatile PTUDEBUGSTR _PTUDEBUG;                            /* PTU Debug Register; 0x0000059F */
volatile TIM0TIOSSTR _TIM0TIOS;                            /* Timer Input Capture/Output Compare Select; 0x000005C0 */
